Config/DataProcessors/ПодборДокументаОснованияЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПодборДокументаОснованияЧекаККМ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учащийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Дети</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыЧекаККМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснованиеЧекаККМ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КвитанцияНаОплатуГосуслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.НакладнаяНаРеализациюТорг12</v8:Type>
								<v8:Type>cfg:DocumentRef.НакладнаяНаОтпускМ15</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.АктОбОказанииУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/DataProcessors/ПодборДокументаОснованияЧекаККМ/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ПеренестиВДокумент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ЗначениеСвойства;
	
	Объект.Организация = Параметры.Организация;
	Объект.Контрагент = Параметры.Контрагент;
	Объект.Договор = Параметры.Договор;
	
	КонтрагентИзДокумента = Параметры.Контрагент; 
	ДоговорИзДокумента = Параметры.Договор; 
	
	Объект.НачалоПериода = НачалоГода(ТекущаяДата());
	Объект.КонецПериода = КонецГода(ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПеренестиВДокумент <> Истина И Модифицированность Тогда
	
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр("ru = 'Список документов-оснований не перенесен в документ.
			|
			|Перенести?'"), РежимДиалогаВопрос.ДаНетОтмена);
			
		Отказ = Истина;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВДокумент = Истина Тогда
		АдресДокументыОснованияВХранилище = ПоместитьДокументыОснованияВХранилище();
		Структура = Новый Структура("АдресДокументыОснованияВХранилище", АдресДокументыОснованияВХранилище);
		ПеренестиВДокумент = Истина;
		ОповеститьОВыборе(Структура);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьСписок(Команда)
	Объект.ДокументыЧекаККМ.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВДокумент(Команда)

	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоговорИзДокумента(Команда)
	Объект.Договор = ДоговорИзДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонтрагентаИзДокумента(Команда)
	Объект.Контрагент = КонтрагентИзДокумента;
КонецПроцедуры

&НаКлиенте
Процедура НайтиДокументы(Команда)
	НайтиДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоПериода",	Объект["НачалоПериода"]);
	СтруктураПараметров.Вставить("КонецПериода",	Объект["КонецПериода"]);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НайтиДокументыНаСервере()
	
	Если Объект.КонецПериода = Дата(1,1,1) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнена дата окончания периода!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Объект.ДокументыЧекаККМ.Очистить();
		
		Возврат;
	Конецесли;	
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	АктОбОказанииУслуг.Ссылка КАК ДокументОснованиеЧекаККМ,
	               |	АктОбОказанииУслуг.СуммаДокумента КАК Сумма,
	               |	АктОбОказанииУслуг.Дата КАК Дата,
	               |	АктОбОказанииУслуг.Номер КАК Номер
	               |ИЗ
	               |	Документ.АктОбОказанииУслуг КАК АктОбОказанииУслуг
	               |ГДЕ
	               |	(&ТипДокумента = 1
	               |			ИЛИ &ТипДокумента = 0)
	               |	И АктОбОказанииУслуг.Организация = &Организация
	               |	И АктОбОказанииУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И &НетОтбораПоКонтрагентуДля1ТипаДокумента
	               |	И &НетОтбораПоДоговоруДля1ТипаДокумента
	               |	И АктОбОказанииУслуг.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КвитанцияНаОплатуГосуслуг.Ссылка,
	               |	КвитанцияНаОплатуГосуслуг.СуммаДокумента,
	               |	КвитанцияНаОплатуГосуслуг.Дата,
	               |	КвитанцияНаОплатуГосуслуг.Номер
	               |ИЗ
	               |	Документ.КвитанцияНаОплатуГосуслуг КАК КвитанцияНаОплатуГосуслуг
	               |ГДЕ
	               |	(&ТипДокумента = 2
	               |			ИЛИ &ТипДокумента = 0)
	               |	И КвитанцияНаОплатуГосуслуг.Организация = &Организация
	               |	И КвитанцияНаОплатуГосуслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И &НетОтбораПоКонтрагентуДля2ТипаДокумента
	               |	И &НетОтбораПоДоговоруДля2ТипаДокумента
	               |	И &НетОтбораПоУчащемуся
	               |	И КвитанцияНаОплатуГосуслуг.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НакладнаяНаОтпускМ15.Ссылка,
	               |	НакладнаяНаОтпускМ15.СуммаДокумента,
	               |	НакладнаяНаОтпускМ15.Дата,
	               |	НакладнаяНаОтпускМ15.Номер
	               |ИЗ
	               |	Документ.НакладнаяНаОтпускМ15 КАК НакладнаяНаОтпускМ15
	               |ГДЕ
	               |	(&ТипДокумента = 3
	               |			ИЛИ &ТипДокумента = 0)
	               |	И НакладнаяНаОтпускМ15.Организация = &Организация
	               |	И НакладнаяНаОтпускМ15.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И &НетОтбораПоКонтрагентуДля3ТипаДокумента
	               |	И &НетОтбораПоДоговоруДля3ТипаДокумента
	               |	И НакладнаяНаОтпускМ15.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НакладнаяНаРеализациюТорг12.Ссылка,
	               |	НакладнаяНаРеализациюТорг12.СуммаДокумента,
	               |	НакладнаяНаРеализациюТорг12.Дата,
	               |	НакладнаяНаРеализациюТорг12.Номер
	               |ИЗ
	               |	Документ.НакладнаяНаРеализациюТорг12 КАК НакладнаяНаРеализациюТорг12
	               |ГДЕ
	               |	(&ТипДокумента = 4
	               |			ИЛИ &ТипДокумента = 0)
	               |	И НакладнаяНаРеализациюТорг12.Организация = &Организация
	               |	И НакладнаяНаРеализациюТорг12.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И &НетОтбораПоКонтрагентуДля4ТипаДокумента
	               |	И &НетОтбораПоДоговоруДля4ТипаДокумента
	               |	И НакладнаяНаРеализациюТорг12.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СчетНаОплату.Ссылка,
	               |	СчетНаОплату.СуммаДокумента,
	               |	СчетНаОплату.Дата,
	               |	СчетНаОплату.Номер
	               |ИЗ
	               |	Документ.СчетНаОплату КАК СчетНаОплату
	               |ГДЕ
	               |	(&ТипДокумента = 5
	               |			ИЛИ &ТипДокумента = 0)
	               |	И СчетНаОплату.Организация = &Организация
	               |	И СчетНаОплату.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И &НетОтбораПоКонтрагентуДля5ТипаДокумента
	               |	И &НетОтбораПоДоговоруДля5ТипаДокумента
	               |	И СчетНаОплату.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ,
	               |	ДокументОснованиеЧекаККМ УБЫВ,
	               |	Сумма УБЫВ";
				   
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НетОтбораПоКонтрагентуДля1ТипаДокумента", "АктОбОказанииУслуг.Контрагент = &Контрагент");			   
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НетОтбораПоКонтрагентуДля2ТипаДокумента", "КвитанцияНаОплатуГосуслуг.Плательщик = &Контрагент");			   
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НетОтбораПоКонтрагентуДля3ТипаДокумента", "НакладнаяНаОтпускМ15.Контрагент = &Контрагент");			   
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НетОтбораПоКонтрагентуДля4ТипаДокумента", "НакладнаяНаРеализациюТорг12.Контрагент = &Контрагент");			   
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НетОтбораПоКонтрагентуДля5ТипаДокумента", "СчетНаОплату.Контрагент = &Контрагент");			   
	Иначе
		Запрос.УстановитьПараметр("НетОтбораПоКонтрагентуДля1ТипаДокумента", Истина);			   
		Запрос.УстановитьПараметр("НетОтбораПоКонтрагентуДля2ТипаДокумента", Истина);			   
		Запрос.УстановитьПараметр("НетОтбораПоКонтрагентуДля3ТипаДокумента", Истина);			   
		Запрос.УстановитьПараметр("НетОтбораПоКонтрагентуДля4ТипаДокумента", Истина);			   
		Запрос.УстановитьПараметр("НетОтбораПоКонтрагентуДля5ТипаДокумента", Истина);			   
	КонецЕсли;				   
				   
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НетОтбораПоДоговоруДля1ТипаДокумента", "АктОбОказанииУслуг.Договор = &Договор");			   
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НетОтбораПоДоговоруДля2ТипаДокумента", "КвитанцияНаОплатуГосуслуг.Договор = &Договор");			   
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НетОтбораПоДоговоруДля3ТипаДокумента", "НакладнаяНаОтпускМ15.Договор = &Договор");			   
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НетОтбораПоДоговоруДля4ТипаДокумента", "НакладнаяНаРеализациюТорг12.Договор = &Договор");			   
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НетОтбораПоДоговоруДля5ТипаДокумента", "СчетНаОплату.Договор = &Договор");			   
	Иначе
		Запрос.УстановитьПараметр("НетОтбораПоДоговоруДля1ТипаДокумента", Истина);			   
		Запрос.УстановитьПараметр("НетОтбораПоДоговоруДля2ТипаДокумента", Истина);			   
		Запрос.УстановитьПараметр("НетОтбораПоДоговоруДля3ТипаДокумента", Истина);			   
		Запрос.УстановитьПараметр("НетОтбораПоДоговоруДля4ТипаДокумента", Истина);			   
		Запрос.УстановитьПараметр("НетОтбораПоДоговоруДля5ТипаДокумента", Истина);			   
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Учащийся) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НетОтбораПоУчащемуся", "КвитанцияНаОплатуГосуслуг.Учащийся = &Учащийся");
	Иначе
		Запрос.УстановитьПараметр("НетОтбораПоУчащемуся", Истина);			   
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
				   
	Запрос.УстановитьПараметр("ТипДокумента", ?(ЗначениеЗаполнено(Объект.Учащийся), 2 ,Объект.ТипДокумента));			   
	Запрос.УстановитьПараметр("Организация", Объект.Организация);			   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.НачалоПериода));			   
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.КонецПериода)+1);			   
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);			   
	Запрос.УстановитьПараметр("Договор", Объект.Договор);			   
	Запрос.УстановитьПараметр("Учащийся", Объект.Учащийся);			   
	
	РезультатыЗапроса = Запрос.Выполнить().Выгрузить();
	
	Объект.ДокументыЧекаККМ.Загрузить(РезультатыЗапроса);
КонецПроцедуры


&НаКлиенте
Процедура УстановитьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Объект["НачалоПериода"]	= РезультатВыбора["НачалоПериода"];
		Объект["КонецПериода"]	= РезультатВыбора["КонецПериода"];
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДокументыОснованияВХранилище()
	ПараметрыОтбора = Новый Структура;
	
	ПараметрыОтбора.Вставить("Выбор", Истина);
    МассивДокументов = Объект.ДокументыЧекаККМ.НайтиСтроки(ПараметрыОтбора);
	
	АдресДМВХранилище = ПоместитьВоВременноеХранилище(МассивДокументов, УникальныйИдентификатор);

	Возврат АдресДМВХранилище;

КонецФункции



#КонецОбласти
